//
//  CategoryData.swift
//  єОзброєння
//
//  Created by Oleksandr Smakhtin on 22.08.2022.
//

import Foundation

struct CategoryData {
    
    let categories = [
        "Стрілецька зброя",
        "Бронетехніка",
        "Артилерія",
        "Системи зв'язку",
        "Радіолокаційні станції",
        "Системи протиповітряної оборони",
        "Системи берегової оборони",
        "Інженерна техніка",
        "Автомобілі",
        "Авіаційна техніка",
        "Морське озброєння",  // -
        "Оптичні прилади",  // -
        "Системи захисту"  // -
    ]
}
